{"2024 Q1": {"url": "https://www.fool.com/earnings/call-transcripts/2023/09/20/fedex-fdx-q1-2024-earnings-call-transcript/", "collection_id": "65c5ad86-e2c7-4785-8e2c-7bcdce6c1199", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive tone and language used throughout the transcript, with mentions of \"strong start for the year,\" \"cost savings,\" \"momentum,\" \"differentiated network,\" \"great culture,\" and \"incredible opportunity.\" |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Raj Subramaniam | Discussed FedEx's strong start to the year, execution of structural cost reductions, and plans for continued transformation across the company. |\n| Brie Carere | Provided an update on FedEx's key strategic focus areas, including One FedEx and Network 2.0, and discussed the company's efforts to simplify its organization and improve the customer experience. |\n| John Dietrich | Discussed FedEx's financial performance, including the company's ability to deliver high-quality revenue and maintain margins, and outlined the company's financial goals and priorities. |\n| Mickey Foster | Welcomed John Dietrich to the company and thanked him for his outstanding service to FedEx over the years. |\n| Jordan Alliger | Asked a question about the company's cost savings initiatives and the impact of labor negotiations on FedEx's business. |\n| Jeff Kauffman | Asked a question about the company's adjusted EPS outlook range and the impact of the company's cost savings initiatives on its financial performance. |\n| Wadewitz | Asked a question about the company's plans for returning cash to shareholders and reinvesting in the business. |\n| Jack Atkins | Asked a question about the company's efforts to leverage its data to make its network more efficient and drive new profitable revenue streams through digital. |\n| Jon Chappell | Asked a question about the company's plans for integrating its businesses through One FedEx and executing on DRIVE and Network 2.0 initiatives. |\n| Operator | Announced the end of the question-and-answer session and thanked the participants for their attention. |"}, "2023 Q4": {"url": "https://www.fool.com/earnings/call-transcripts/2023/06/20/fedex-fdx-q4-2023-earnings-call-transcript/", "collection_id": "e06d5aa1-272d-43c4-809e-b06dbd1b2bbe", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of \"continued progress\" and \"tremendous progress\" on the company's transformation efforts, as well as the introduction of new services and tools. |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Raj Subramaniam | Discussed market trends and commercial strategy, mentioned the company's commitment to driving operational improvement and enhancing the customer experience. |\n| Mike Lenz | Spoke about the company's financial performance, including revenue declines, margin pressure, and cost-out efforts. Mentioned the impact of the UPS labor negotiation and the company's sales pipeline. |\n| Brie Carere | Discussed the company's progress on its transformation journey, including the expansion of picture proof of delivery and estimated time delivery window. Mentioned the company's focus on returns and growth. |\n| Allison Poliniak | Asked a question about the company's hiring practices and succession planning. |\n| Jordan Alliger | Asked a question about the company's cost structure and flexibility. |\n| Jon Chappell | Asked a question about the company's international export yield pressure and its impact on pre-COVID levels. |\n| Brian Ossenbeck | Asked a question about the company's LTL side and its response to a major competitor's solvency concerns. |\n| Mickey Foster | Hosted the conference call and introduced the speakers. |"}, "2023 Q3": {"url": "https://www.fool.com/earnings/call-transcripts/2023/03/17/fedex-fdx-q3-2023-earnings-call-transcript/", "collection_id": "65751f17-39c0-4500-84e0-cb24a8041f86", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of \"very pleased,\" \"good afternoon,\" \"outstanding service,\" \"tangible signs of fundamental transmission,\" \"creating significant value for stockholders,\" and \"winning new business.\" |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Raj Subramaniam | Discussed the demand softness in the express business and the steps being taken to address it, including cost-cutting measures and improving service levels. |\n| Brie Carere | Highlighted the progress made in the third quarter, including revenue growth, margin expansion, and improved service levels. Discussed the benefits of the company's digital transformation and the rollout of new offerings. |\n| Mike Lenz | Provided details on the company's cost structure and the actions being taken to reduce costs, including managing staffing levels and purchased transportation costs. Discussed the impact of these efforts on profitability. |\n| Mickey Foster | Introduced the call and provided an overview of the company's performance, including the impact of weather disruptions and the steps being taken to realign the cost structure. |\n| Ken Hoexter | Asked a question about the company's ability to raise prices and the impact of fuel surcharges on revenue. |\n| Chris Wetherbee | Asked a question about the company's cost structure and the steps being taken to improve profitability. |\n| Jack Atkins | Asked a question about the company's ability to sustain its cost savings initiatives. |\n| Jordan Alliger | Asked a question about the company's revenue growth and the impact of the digital transformation on the business. |\n| Tom Wadewitz | Asked a question about the company's cost structure and the steps being taken to improve profitability. |\n| Jon Chappell | Asked a question about the company's ability to improve its service levels and the impact of the digital transformation on the business. |\n| Helane Becker | Asked a question about the company's cost structure and the steps being taken to improve profitability. |\n| Brandon Oglenski | Asked a question about the company's ability to sustain its cost savings initiatives. |\n| Allison Poliniak | Asked a question about the company's revenue growth and the impact of the digital transformation on the business. |\n| Ariel Rosa | Asked a question about the company's cost structure and the steps being taken to improve profitability. |\n| Stephanie Moore | Asked a question about the company's ability to improve its service levels and the impact of the digital transformation on the business. |\n| Scott Group | Asked a question about the company's cost structure and the steps being taken to improve profitability. |\n| Brian Ossenbeck | Asked a question about the company's revenue growth and the impact of the digital transformation on the business. |"}, "2023 Q2": {"url": "https://www.fool.com/earnings/call-transcripts/2022/12/21/fedex-fdx-q2-2023-earnings-call-transcript/", "collection_id": "3296721b-08c0-430e-9905-70646c7ebf91", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive tone and language used throughout the transcript, with emphasis on cost savings, revenue growth, and innovation. |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Raj | Discussed Q2 results, momentum, and cost actions. Mentioned the team's ability to sustain excellent service during peak season while transforming the global network. |\n| Lenz | Provided additional context about the $3.7 billion reduction, which refers to the scope and magnitude of cost initiatives undertaken to address changed circumstances. Mentioned permanent reductions in demand environment and structural changes, such as flight takedowns, that won't come back. |\n| Brie | Discussed recent market trends and commercial strategy in more detail. Mentioned the operating environment in Q2 and how the team is focused on cutting costs immediately and structurally transforming the network. |\n| Mickey | Welcomed participants to the call and introduced the speakers. Mentioned that the second quarter earnings release, Form 10-Q, and stat book are on the company's website. |\n| Tom | Asked a question about the additional $1 billion in cost takeout and the legacy TNT business's impact on Express profit. |\n| Becker | Asked a question about pricing discipline in the Freight business and whether FedEx is lowering prices to get more volumes. |\n| Brian | Asked a question about balancing cost and price, particularly in the declining volume environment, and how FedEx will approach Teamsters negotiations. |\n\nI hope this helps! Let me know if you have any further questions."}, "2023 Q1": {"url": "https://www.fool.com/earnings/call-transcripts/2022/09/23/fedex-fdx-q1-2023-earnings-call-transcript/", "collection_id": "e8ac0ba2-20ec-4175-a28d-d2c79a8f37fb", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 3 | Neutral |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Raj Subramaniam | Discussed the company's performance, cost savings, and growth strategies. |\n| Brie Carere | Spoke about market trends, commercial strategy, and the performance of FedEx Ground and Freight. |\n| Mike Lenz | Explained the reason behind the company's choice to launch a Q&A with CNBC instead of hosting a conference call. |\n| Ken Lenz | Asked a question about the festering Ground contractor issue and the possibility of using cost savings to resolve the issues. |\n| Mickey Foster | Welcomed everyone to the call and introduced the speakers. |\n| Mehrotra | Asked a question about the company's cost initiatives and their impact on profits. |\n| Jack | Asked a question about the team's ability to lead the company into the future and the possibility of bringing in outside talent. |\n| Brandon | Expressed concerns about the company's performance and asked a question about the team's commitment to taking cost levers out. |\n| Ari | Asked a question about the sustainability of FedEx Freight's performance and the potential impact of a downturn on the company's gains. |"}, "2022 Q4": {"url": "https://www.fool.com/earnings/call-transcripts/2022/06/24/fedex-fdx-q4-2022-earnings-call-transcript/", "collection_id": "14fbd483-19a7-44be-beab-1c7294e6a85a", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of \"incredibly proud\" and \"very focused\" on delivering value to customers. Also, the company is investing in new capabilities for its healthcare customers and has a strong loyalty program for small businesses. However, there are some concerns about service levels and cost control, with mentions of staffing challenges and higher loss experience. The company is taking steps to mitigate these issues, such as implementing new vehicle safety technology and driver certification standards. The overall sentiment is positive, but with some cautionary notes about operational challenges and cost control. |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Mike Lenz | Discussed FedEx's fourth quarter earnings and the company's performance, including revenue growth and operating income. He also mentioned the challenges faced by the company in the past year and their efforts to navigate uncertainty. |\n| Raj Subramaniam | Provided an overview of FedEx's performance in fiscal year 2022 and discussed the company's commercial strategy and focus on revenue quality. He also talked about the outlook for fiscal year 2023 and the company's efforts to improve profitability. |\n| Brie Carere | Discussed FedEx's commercial strategy and the company's focus on delivering for its customers. She also talked about the importance of data and tools for small businesses and the company's efforts to intervene for healthcare customers. |\n| Tom Wadewitz | Asked a question about FedEx's annual EPS and the company's value proposition for small businesses. |\n| Ken Hoexter | Asked a question about FedEx's capital and return focus, and the company's involvement of an activist. |\n| Foster | Reminded listeners that FedEx Corporation desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act. |\n| David Vernon | Asked a question about the operational situation at FedEx, including the impact of staffing challenges on service levels and the company's recovery on the productivity side. |"}, "2022 Q3": {"url": "https://www.fool.com/earnings/call-transcripts/2022/03/18/fedex-fdx-q3-2022-earnings-call-transcript/", "collection_id": "fbfb56af-59c9-4efd-aea4-4d9f8827be97", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive comments about FedEx's financial performance, such as \"strongest cash flow,\" \"accelerated share repurchase program,\" and \"substantially higher operating income\". Mention of \"market-leading digital portfolio\" and \"most profitable December in company history\"  Discussion of strategic investments in network and technology to improve margins Emphasis on disciplined approach to small business acquisition strategy and focus on employee retention Recognition of challenges from omicron and labor environment, but also mention of stabilization in labor environment and improvement in labor headwind. No significant negative comments or concerns about FedEx's performance or future prospects |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Raj Subramaniam | Discussed FedEx's third quarter earnings, including revenue growth, operating income, and margin expansion. Mentioned the impact of the omicron variant on operations and the macro environment. |\n| Brie Carere | Spoke about FedEx's targeted revenue growth strategy, focusing on market share perspective and business perspective. Highlighted the company's enhancements in network and value proposition. |\n| Mike Lenz | Provided details on FedEx's third quarter financial results, including adjusted operating income, market conditions, and labor network inefficiencies. |\n| Foster | Introduced the FedEx Corporation's third quarter earnings conference call and provided information on the call's format and availability. |\n| Henry | Asked a question about Ground margins and the plan to reverse the long-term trend of low profitability. |\n| Amit | Asked a question about FedEx Freight's performance and the impact of the competitive labor environment. |\n| Jack Atkins | Asked a question about Ground's cost inflation and the ability to drive revenue per package ahead of cost per package. |\n| Brandon Oglenski | Asked a question about the appointment of Richard at Express and what the company hopes to achieve with the leadership change. |"}, "2022 Q2": {"url": "https://www.fool.com/earnings/call-transcripts/2021/12/17/fedex-corporation-fdx-q2-2022-earnings-call-transc/", "collection_id": "fcf73c56-b93b-4884-913f-045d6607528e", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of \"confidence\" and \"optimism\" regarding the company's performance and future outlook. |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Mike Lenz | Discussed FedEx's second quarter financial results, including adjusted operating income, effective tax rate, and earnings per share. Mentioned the impact of staffing challenges and headwinds on profitability. |\n| Raj Subramaniam | Highlighted FedEx's commercial strategies for revenue growth and yield improvement. Mentioned the company's efforts to improve its carbon footprint and achieve carbon neutrality by 2040. |\n| Brie Carere | Discussed FedEx's hiring efforts and the importance of retaining team members post-peak. Mentioned the company's focus on improving its networks and making them more efficient. |\n| Frederick W. Smith | Expressed support for free trade and the importance of the United States staying engaged in China. Mentioned the benefits of trade for the US economy and the potential for a more normalized trading relationship with China through the Trans-Pacific Partnership. |\n| Jordan Alliger | Asked a question about FedEx's hiring efforts and the progress made in hiring core positions versus seasonal employees. |\n| Jeff Kauffman | Asked a question about FedEx's view on the status of trade policy and any potential catalysts that might occur to benefit the company. |\n| Helane Becker | Asked a question about FedEx's carbon-neutral goals and the company's efforts to reduce its carbon footprint. |\n| Chris Wetherbee | Asked a question about FedEx's ability to sustain its margins in the face of increased competition and capacity. |\n| Jack Atkins | Asked a question about FedEx's strategy for improving its express business and the potential for price increases. |\n| Duane Pfennigwerth | Asked a question about FedEx's cost structure and the impact of peak season on the company's financials. |\n| Brian Ossenbeck | Asked a question about FedEx's guidance for the third quarter and the company's expectations for the rest of the year. |\n| Scott Group | Asked a question about FedEx's plans for capital allocation and share repurchases. |\n| Tom Wadewitz | Asked a question about FedEx's strategy for expanding its e-commerce business and the potential for partnerships with e-commerce companies. |\n| Raj Subramaniam | Responded to a question about FedEx's efforts to improve its carbon footprint and achieve carbon neutrality by 2040. |\n| Mike Lenz | Responded to a question about FedEx's tax strategy and the potential impact of a tax on share repurchases. |\n| Frederick W. Smith | Responded to a question about FedEx's view on the status of trade policy and the potential for a more normalized trading relationship with China through the Trans-Pacific Partnership. |\n| Brie Carere | Responded to a question about FedEx's hiring efforts and the importance of retaining team members post-peak. |\n| Raj Subramaniam | Responded to a question about FedEx's commercial strategies for revenue growth and yield improvement. |\n| Mike Lenz | Responded to a question about FedEx's second quarter financial results and the impact of staffing challenges and headwinds on profitability. |\n| Frederick W. Smith | Responded to a question about FedEx's investment strategy and the company's focus on long-term returns. |\n| Brie Carere | Responded to a question about FedEx's efforts to improve its networks and make them more efficient. |\n| Raj Subramaniam | Responded to a question about FedEx's strategy for expanding its e-commerce business and the potential for partnerships with e-commerce companies. |\n| Mike Lenz | Responded to a question about FedEx's guidance for the third quarter and the company's expectations for the rest of the year. |\n| Frederick W. Smith | Responded to a question about FedEx's view on the status of trade policy and the potential for a more normalized trading relationship with China through the Trans-Pacific Partnership. |\n| Brie Carere | Responded to a question about FedEx's hiring efforts and the importance of retaining team members post-peak. |\n| Raj Subramaniam | Responded to a question about FedEx's commercial strategies for revenue growth and yield improvement. |\n|"}, "2022 Q1": {"url": "https://www.fool.com/earnings/call-transcripts/2021/09/21/fedex-corporation-fdx-q1-2022-earnings-call-transc/", "collection_id": "3b6556ab-6805-4dcc-9932-d8e507db37de", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 3 | The sentiment of the transcript is relatively neutral, with a mix of positive and negative elements discussed. The company is facing challenges related to labor shortages and costs, but also sees opportunities for growth and is taking steps to address the issues. The tone is professional and informative, without any overly positive or negative language. |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Raj | Discussed the impact of labor shortages on FedEx's business, including a $450 million impact on quarterly results, and highlighted efforts to mitigate the issue. |\n| Mike Lenz | Discussed the company's strategies for driving high demand for services despite challenges, including capacity constraints, and mentioned investments in smaller units of capacity and utilizing assets more efficiently. |\n| Brandon Oglenski | Asked about bold actions that can be taken to improve margins and ROIC, and mentioned the company's WACC and historical capital intensity. |\n| Raj (continued) | Explained the reasoning behind the company's decision to cut full-year guidance by approximately the magnitude of the first quarter mix, and emphasized that the company is not sitting on its hands amidst the challenges. |\n| Mike Lenz (continued) | Mentioned the company's focus on returns and addressed questions about Ground and investment there, highlighting returns and margin levels. |\n| Ravi Shanker | Asked a question about the confidence in the second half being significantly better than the first half, given the non-operational items in the second half. |"}, "2021 Q4": {"url": "https://www.fool.com/earnings/call-transcripts/2021/06/25/fedex-corp-fdx-q4-2021-earnings-call-transcript/", "collection_id": "a3ae2667-6a09-4758-b096-b1c4e7652d30", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive tone and language used throughout the transcript, with mentions of strong financial performance, growth strategies, and successful execution |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Frederick W. Smith | Opening remarks, discussed FedEx's financial performance, and recognized Henry Maier's service to the company. |\n| Rajesh Subramaniam | Discussed the growth of e-commerce and its impact on FedEx's business, highlighted the company's strategic focus areas, and mentioned the tragic loss of eight team members at a FedEx Ground facility in Indianapolis. |\n| Mickey Foster | Handled the administrative aspects of the call and introduced the speakers. |\n| Mike Lenz | Discussed the company's financial performance, including revenue growth and margin expansion, and addressed a question about surcharges. |\n| Brie Carere | Discussed the company's marketing strategy and the importance of e-commerce in FedEx's growth. |\n| John Smith | Not mentioned in the provided transcript. |\n| Henry Maier | Not mentioned in the provided transcript. |\n| Lance Moll | Not mentioned in the provided transcript. |\n| Mark Allen | Not mentioned in the provided transcript. |\n| Rob Carter | Not mentioned in the provided transcript. |\n| Jill Brannon | Not mentioned in the provided transcript. |\n| Don Colleran | Not mentioned in the provided transcript. |"}, "2021 Q3": {"url": "https://www.fool.com/earnings/call-transcripts/2021/03/18/fedex-corp-fdx-q3-2021-earnings-call-transcript/", "collection_id": "654f0167-410e-4353-971e-62f71bf02419", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive comments about the company's performance and outlook, such as \"strong volume growth in US domestic residential package,\" \"solid execution of our revenue management strategies,\" and \"profound impact\" of vaccine delivery |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Fred Smith | Introduced the call and discussed the company's performance during the peak season, highlighting the team's efforts in delivering a record-breaking number of packages. |\n| Raj Subramaniam | Discussed the company's financial results, including revenue and operating profit increases, and highlighted the success of the company's revenue management strategies. |\n| Mike Lenz | Discussed the impact of severe winter weather on the company's operations and the steps taken to mitigate the impact, including adding sortation capacity and collaborating across the network. |\n| Brie Carere | Discussed the growth of the domestic parcel market and the company's strategy to strengthen its capabilities and drive upside in Europe. |\n| Mark Allen | Not mentioned in the provided context. |\n| Rob Carter | Not mentioned in the provided context. |\n| Jill Brannon | Not mentioned in the provided context. |\n| Don Colleran | Not mentioned in the provided context. |\n| Henry Maier | Not mentioned in the provided context. |\n| John Smith | Not mentioned in the provided context. |\n| Lance Moll | Not mentioned in the provided context. |"}, "2021 Q2": {"url": "https://www.fool.com/earnings/call-transcripts/2020/12/17/fedex-corp-fdx-q2-2021-earnings-call-transcript/", "collection_id": "d389086b-1e30-4695-a66f-3ffec29b3186", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of \"record performance,\" \"upside opportunity,\" \"growth strategy,\" and \"innovative digital solutions\" |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Mickey Foster | Introduced the call and discussed the agenda. |\n| Frederick W. Smith | Shared his views on the quarter and introduced the new strategic operating principles. |\n| Brie Carere | Discussed the success of Q2 and the strategy kick-started nearly two years ago. |\n| Rajesh Subramaniam | Discussed the principle of operating collaboratively and innovate digitally. |\n| Mike Lenz | Highlighted a few points as the new voice on the call and discussed the financials. |\n| Henry J. Maier | Discussed the collaboration between the segments and the success of Q2. |\n| Donald F. Colleran | Discussed the principle of compete collectively and operate collaboratively. |\n| David Ross | Asked a question about the incremental color on the peak. |\n| Brandon Oglenski | Asked a question about the collaboration between the segments. |\n| Bascome Majors | Asked a question about the capacity that FedEx provides. |\n| Scott Schneeberger | Asked a question about the choppy trends in the immediate short term. |\n| Amit Mehrotra | Asked a question about the international segment. |\n| Thomas Wadewitz | Asked a question about the inventory restocking. |\n| Jordan Alliger | Asked a question about the e-commerce space. |\n| Scott Group | Asked a question about the B2B segment. |\n| Duane Pfennigwerth | Asked a question about the long-term future-ready strategy. |\n\nI hope this helps! Let me know if you have any further questions."}, "2021 Q1": {"url": "https://www.fool.com/earnings/call-transcripts/2020/09/15/fedex-corp-fdx-q1-2021-earnings-call-transcript/", "collection_id": "e1394d9c-7659-4f3a-aaf4-71ac171072e9", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of strong financial performance, growth opportunities, and optimism about the future |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| B. Graf | Discussed the company's capex needs and uses of incremental free cash flow, and the importance of maintaining a strong balance sheet. |\n| Raj Subramaniam | Not mentioned |\n| Alan Graf | Discussed the company's performance in the quarter, the acquisition of TNT, and the importance of FedEx's industry and its role in e-commerce growth. |\n| Fred Smith | Not mentioned |\n| Mark Allen | Not mentioned |\n| Rob Carter | Not mentioned |\n| Brie Carere | Not mentioned |\n| Don Colleran | Not mentioned |\n| Henry Maier | Not mentioned |\n| John Smith | Not mentioned |\n| Mickey Foster | Moderated the call and provided opening and closing remarks. |\n| Tom | Asked a question about one-time items in the quarter. |\n| Jack Atkins | Asked a question about the company's performance. |\n| W. Smith | Gave closing remarks and thanked Alan Graf for his service. |"}, "2020 Q4": {"url": "https://www.fool.com/earnings/call-transcripts/2020/06/30/fedex-corp-fdx-q4-2020-earnings-call-transcript.aspx", "collection_id": "90757a74-22ea-41bc-8a06-7de3cba5f8d6", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive comments about the company's performance and future prospects, such as \"strong demand for Ground for some time in the future\" and \"we'll continue to invest heavily in Ground\". Mention of efforts to improve balance sheet and pay down debt. Discussion of strategic initiatives and investments in FedEx Ground leading to improved performance. Positive outlook on B2B volume and residential deliveries. Emphasis on safety and well-being of team members and customers. Recognition of challenges posed by COVID-19 and efforts to keep supply chains open. Mention of surcharge and efforts to improve revenue quality. Discussion of cost structure and efforts to maximize density and reduce costs in FedEx Express. Positive comment on the team's performance and efforts during the pandemic. Mention of growth in FedEx Freight and improvement in yield growth |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Brie Carere | Discussed the revenue quality of FedEx's commercial business, specifically the success of the surcharge implemented during the pandemic and the two-tiered strategy for managing revenue quality. |\n| Rajesh Subramaniam | Highlighted the disciplined management of cost structure in FedEx Express, including capacity management, redeployment, and streamlining of organization structure. Mentioned the Last Mile Optimization program to reduce cost and improve density. |\n| F. Colleran | Emphasized the safety and well-being of team members and customers as the top priority. Discussed the resilience of FedEx's network and team during the pandemic, and highlighted the efforts to keep critical supplies and supply chains moving. |\n| Alan B. Graf | Addressed the question of when delivery density and pricing actions will yield improved margins and profitability in the Ground segment. Indicated that the company is focused on improving efficiency and effectiveness by streamlining organizational structure and investing in productivity-enhancing technology. |\n| Henry J. Maier | Discussed the progress made in FedEx Ground, including the integration of line-haul and pickup and delivery operations, and the enhancement of international services. Mentioned the importance of density and the focus on lowering costs through investments in technology. |\n| J. Maier | Expressed satisfaction with the revenue per piece from a B2C perspective and the capture on the surcharge. Emphasized the need to continue to find win-win solutions with large customers. |\n| Vernon | Asked a question about the Ground business, specifically regarding the structural changes taking place and their impact on margin performance. |\n| David | Asked a question about the balance sheet and cash flows, and inquired about the company's objective to improve its balance sheet significantly over the next few years. |\n| Tom Wadewitz | Asked a question about the structural changes taking place in the Ground business and their impact on margin performance. |\n| Jack Atkins | Asked a question about when the company expects to start seeing leverage in the model within Ground, specifically regarding delivery density and pricing actions. |\n| Don | Emphasized the importance of safety and well-being of team members and customers, and highlighted FedEx's efforts to keep critical supplies and supply chains moving during the pandemic. |\n| Mickey Foster | Welcomed participants to the call and introduced the speakers. Reminded listeners of the Safe Harbor provisions of the Private Securities Litigation Reform Act and mentioned that certain statements in the conference call may be considered forward-looking statements. |"}, "2020 Q3": {"url": "https://www.fool.com/earnings/call-transcripts/2020/03/17/fedex-corp-fdx-q3-2020-earnings-call-transcript.aspx", "collection_id": "a9fe3c0d-f103-4f3f-902e-d47bcf842261", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 4 | Positive sentiment overall, with mentions of \"significant growth,\" \"low-cost producer,\" \"market leader,\" and \"successful\" efforts in addressing the pandemic. |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Mickey Foster | Introduces the third quarter earnings conference call and provides an overview of the agenda. |\n| Frederick W. Smith | Discusses the impact of the coronavirus on FedEx's business and operations, and the company's efforts to mitigate the effects and assist in relief efforts. |\n| Brie Carere | Provides an update on FedEx's transit times and spot prices, and discusses the company's efforts to manage demand and capacity constraints. |\n| Rajesh Subramaniam | Discusses the performance of FedEx Ground and the company's efforts to transform the business into a more cost-effective transportation company serving the e-commerce market. |\n| Alan B. Graf | Discusses the financial performance of FedEx Freight and the company's efforts to improve revenue quality and execute on core priorities. |\n| Ken Hoexter | Asks a question about the impact of the coronavirus on FedEx's business and operations. |\n| David Ross | Asks a question about the performance of FedEx Ground and the company's efforts to manage capacity constraints. |\n| Brian Ossenbeck | Asks a question about the financial performance of FedEx Freight and the company's efforts to improve profitability. |\n| Tom Wadewitz | Asks a question about the impact of the coronavirus on FedEx's international business and operations. |\n| Jordan Alliger | Asks a question about the company's efforts to manage capacity constraints and improve operational efficiency. |\n| Scott H. Group | Asks a question about the performance of FedEx Ground and the company's efforts to expand its services. |\n| Allison Ann Marie Poliniak-Cusic | Asks a question about the financial performance of FedEx Freight and the company's efforts to improve profitability. |\n| Allison M. Landry | Asks a question about the impact of the coronavirus on FedEx's business and operations. |\n| Brandon Robert Oglenski | Asks a question about the company's efforts to manage capacity constraints and improve operational efficiency. |\n| Jack Lawrence Atkins | Asks a question about the performance of FedEx Ground and the company's efforts to expand its services. |\n| Helane Becker | Asks a question about the impact of the coronavirus on FedEx's business and operations. |"}, "2020 Q2": {"url": "https://www.fool.com/earnings/call-transcripts/2019/12/17/fedex-corp-fdx-q2-2020-earnings-call-transcript.aspx", "collection_id": "4a3a0de5-5024-4053-8e7f-61cf8cf39eb2", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 3 | The transcript discusses FedEx's disappointing second-quarter results and the challenges the company faces, but also expresses optimism about the company's long-term performance and the steps being taken to improve revenue quality and reduce costs. |", "speakers_table": " | Speaker | Summary |\n| --- | --- |\n| Raj Subramaniam | Discussed the company's performance and outlook, emphasizing the need for cost reduction and revenue quality improvement. |\n| Alan Graf | Provided details on the company's financials and discussed the drivers and actions being taken to address the disappointing second-quarter results. |\n| Donald F. Colleran | Emphasized the importance of investing in the company's people and discussed the efforts to improve revenue quality and reduce costs. |\n| Henry Maier | Discussed the challenges faced by the company's Ground business and the steps being taken to address them. |\n| Brie Carere | Discussed the company's marketing and communications efforts and the importance of delivering a premium service to customers. |\n| Rob Carter | Discussed the company's technology and innovation efforts and the importance of staying ahead of the curve. |\n| Mark Allen | Discussed the company's legal and regulatory environment and the efforts to ensure compliance. |\n| John Smith | Discussed the company's Freight business and the efforts to improve its performance. |\n| Mickey Foster | Provided introductory remarks and introduced the speakers. |"}, "2020 Q1": {"url": "https://www.fool.com/earnings/call-transcripts/2019/09/18/fedex-corp-fdx-q1-2020-earnings-call-transcript.aspx", "collection_id": "cdc83b24-85b2-48f0-8a1f-da19fbfa2caa", "ratings_table": " | Rating | Reason for Rating |\n| --- | --- |\n| 3 | Neutral |", "speakers_table": " Sure, here's a table summarizing what each speaker said in the transcript:\n\n| Speaker | Summary |\n| --- | --- |\n| Frederick W. Smith | Discussed FedEx's strategic management committee's identification of three significant challenges to increasing earnings in FY '20, including global trade disputes, TNT integration, and the need to add capabilities to enhance services toward the rapidly growing e-commerce market. |\n| Brie Carere | Not mentioned. |\n| Rajesh Subramaniam | Not mentioned. |\n| Alan B. Graf | Not mentioned. |\n| Henry J. Maier | Not mentioned. |\n| Chris Wetherbee | Asked a question about FedEx's ability to maintain its low-cost, high-service producer position in the short zone market. |\n| Scott Group | Asked a question about FedEx's strategy for dealing with the ongoing trade tensions and their impact on the business. |\n| Jack Atkins | Asked a question about the potential for FedEx to reduce its cost structure in response to the current macro environment. |\n| Mickey Foster | Moderated the call and provided opening and closing remarks, including reminding listeners of the safe harbor provisions of the Private Securities Litigation Reform Act. |"}}